# 闪电网络钱包 Alby，随意更改用户协议，转走用户的BTC 余额，比特币闪电网络生态钱包还安全吗？

今天有社区用户反应，爆料自己在 Alby 钱包中的比特币被莫名扣走，怀疑是被盗窃或者是黑客攻击。

社区随后发现，BTC 是被 Alby 官方扣除，
@getAlby
 在 2025 年 3 月更新的服务条款中规定：“已通知用户一年多，持续一年以上无交易活动的账户，有权扣除余额。”

后有社区博主 
@cryptooo123
 分享，把钱转出就要订阅他们的云服务节点，扣费高达118美元左右，否则根本无法转走资金。而且如果资金不足100美元，根本没法提现。就算是小额资金，也要被“吞”在里面。
显然这种通知，很难让用户注意到，更不用说去理解其中的条款细节。这不是一次单纯的条款更新，而是项目方利用变相“掠夺”用户资产。

Alby 钱包项目方也显然是“吃准”了用户：

1、扣走的金额比较小，用户维权成本就比较高，甚至几百美元在大多数司法辖区立案标准都达不到

2、长期不活跃的地址，大多用户可能都已经忘了上面还有一些小额资产，或者地址/私钥都找不到了。

3、通过用户协议更新偷用户资产，甚至以托管费/云服务费形式扣走，在法律上可能钻了空子。

Alby 钱包随意更改用户协议，非法扣除用户资金，抬高提现门槛的“畜生”行为，也是是比特币生态悲剧的缩影。

这里简单介绍下 Alby 钱包，一个闪电网络托管钱包，主要服务于 Nostr 协议及应用。

Nostr 原是一个基于闪电网络协议的比特币二层协议，之前因为铭文的$treat $trick 爆火有不小的流量。Alby 正是目前支持 Nostr 应用最完善的钱包之一。

值得注意的是，Nostr 协议已经更名为 @LnfiNetwork
，这个协议当时想要玩，资金需要存进去，如果有用过的用户可以去检查一下是否还有余额没有拿出来，趁还能提出来快去提款。

与一般的非托管钱包不同，Alby 采用了“托管钱包”架构，这意味着用户的比特币资产存储在项目方控制的共享钱包（shared wallet）中，私钥部分不由用户掌握。

闪电网络是比特币生态中一项二层扩展技术，极大提升了交易速度和降低交易费用。闪电网络节点需要长时间保持在线，资金在通道内锁定，结算时通道关闭，如果用户不是自己运行节点，那么在用闪电网络时，网络资产并不是自己掌握的。

Alby 提供了云端节点服务，这也是用户为什么必须订阅该云服务节点，否则不能转账提现的原因。铭文协议和托管钱包的风险：用户应及时提取资产，警惕托管陷阱。

此次 Alby 钱包事件，不仅揭示了托管钱包的隐患，也折射出整个比特币生态内类似风险的存在。

当前比特币生态内流行多种铭文协议，如 BRC20、NRC20、Taproot Assets 等，这些项目多数需要依赖闪电网络和托管钱包进行资产发行和流通。

然而，实践证明，许多铭文协议运营难度极大，资产分发不畅，技术和市场不成熟，用户资产安全性难以保障。

托管钱包本质上意味着用户对资产的控制权让渡了一部分给第三方，尤其是像 Alby 这样提供节点服务的项目方。如果项目方无良，或者协议变更，用户资金极易被扣留甚至转走，缺乏有效的法律保护和应急机制。

最后，如果你在类似 Alby 这样的托管钱包中存有比特币资产，特别是为参与某些协议而存入的资产，应尽快将资金转出到非托管钱包：安全起见，尽量使用非托管钱包，自己掌握私钥，确保资产完全控制权。

余弦 
@evilcos
  也表示，自己是 Alby 钱包的受害者。账户中约0.00174788 BTC（约192美元）在2025年5月26日被平台转走。平台声称这是托管账号操作，用户并不知情。

显然这种通知，很难让用户注意到，更不用说去理解其中的条款细节。这不是一次单纯的条款更新，而是项目方利用变相“掠夺”用户资产。

Alby 钱包项目方也明显是“吃准”了用户：

1、扣走的金额比较小，用户维权成本就比较高，甚至几百美元在大多数司法辖区立案标准都达不到

2、长期不活跃的地址，大多用户可能都已经忘了上面还有一些小额资产，或者地址/私钥都找不到了。

3、通过用户协议更新偷用户资产，甚至以托管费/云服务费形式扣走，在法律上可能钻了空子。真较劲的话，可能需要非常专业的法律团队跨国维权。

Alby 钱包随意更改用户协议，非法扣除用户资金，抬高提现门槛的“畜生”行为，也是是比特币生态悲剧的缩影。

这里简单介绍下 Alby 钱包，一个闪电网络托管钱包，主要服务于 Nostr 协议及应用。

Nostr 原是一个基于闪电网络协议的比特币二层协议，之前因为铭文的$treat $trick 爆火有不小的流量。Alby 正是目前支持 Nostr 应用最完善的钱包之一。

值得注意的是，Nostr 协议已经更名为 
@LnfiNetwork
，这个协议当时想要玩，资金需要存进去，如果有用过的用户可以去检查一下是否还有余额没有拿出来，趁还能提出来快去提款。

与一般的非托管钱包不同，Alby 采用了“托管钱包”架构，这意味着用户的比特币资产存储在项目方控制的共享钱包（shared wallet）中，私钥部分不由用户掌握。

闪电网络是比特币生态中一项二层扩展技术，极大提升了交易速度和降低交易费用。闪电网络节点需要长时间保持在线，资金在通道内锁定，并通过智能合约自动结算。

Alby 提供了云端节点服务，这也是用户为什么必须订阅该云服务节点，否则不能转账提现的原因。铭文协议和托管钱包的风险：用户应及时提取资产，警惕托管陷阱。

此次 Alby 钱包事件，不仅揭示了托管钱包的隐患，也折射出整个比特币生态和闪电网络钱包类似风险的存在。

当前比特币生态内流行多种铭文协议，如 BRC20、NRC20、Taproot Assets 等，这些项目多数需要依赖闪电网络和托管钱包进行资产发行和流通。

然而，实践证明，许多铭文协议运营难度极大，资产分发不畅，技术和市场不成熟，用户资产安全性难以保障。

托管钱包本质上意味着用户对资产的控制权让渡了一部分给第三方，尤其是像 Alby 这样提供节点服务的项目方。如果项目方无良，或者协议变更，用户资金极易被扣留甚至转走，缺乏有效的法律保护和应急机制。

最后，如果你在类似 Alby 这样的托管钱包中存有比特币资产，特别是为参与某些协议而存入的资产，应尽快将资金转出到非托管钱包：安全起见，尽量使用非托管钱包，自己掌握私钥，确保资产完全控制权。
